# Исследование надежности заемщиков

Это первая часть проекта, она будет проверена автоматически. Вторую часть проверит ревьюер.

## Откройте таблицу и изучите общую информацию о данных

**Задание 1. Импортируйте библиотеку pandas. Считайте данные из csv-файла в датафрейм и сохраните в переменную `data`. Путь к файлу:**

`/datasets/data.csv`

In [1]:
# импортируйте библиотеку pandas
import pandas as pd
import numpy as np

In [2]:
# прочитайте csv-файл
data = pd.read_csv('data.csv')

**Задание 2. Выведите первые 20 строчек датафрейма `data` на экран.**

In [3]:
# ваш код здесь
print(data.head(20))

    children  days_employed  dob_years            education  education_id  \
0          1   -8437.673028         42               высшее             0
1          1   -4024.803754         36              среднее             1
2          0   -5623.422610         33              Среднее             1
3          3   -4124.747207         32              среднее             1
4          0  340266.072047         53              среднее             1
5          0    -926.185831         27               высшее             0
6          0   -2879.202052         43               высшее             0
7          0    -152.779569         50              СРЕДНЕЕ             1
8          2   -6929.865299         35               ВЫСШЕЕ             0
9          0   -2188.756445         41              среднее             1
10         2   -4171.483647         36               высшее             0
11         0    -792.701887         40              среднее             1
12         0            NaN         65              среднее             1
13         0   -1846.641941         54  неоконченное высшее             2
14         0   -1844.956182         56               высшее             0
15         1    -972.364419         26              среднее             1
16         0   -1719.934226         35              среднее             1
17         0   -2369.999720         33               высшее             0
18         0  400281.136913         53              среднее             1
19         0  -10038.818549         48              СРЕДНЕЕ             1

       family_status  family_status_id gender income_type  debt  \
0    женат / замужем                 0      F   сотрудник     0
1    женат / замужем                 0      F   сотрудник     0
2    женат / замужем                 0      M   сотрудник     0
3    женат / замужем                 0      M   сотрудник     0
4   гражданский брак                 1      F   пенсионер     0
5   гражданский брак                 1      M   компаньон     0
6    женат / замужем                 0      F   компаньон     0
7    женат / замужем                 0      M   сотрудник     0
8   гражданский брак                 1      F   сотрудник     0
9    женат / замужем                 0      M   сотрудник     0
10   женат / замужем                 0      M   компаньон     0
11   женат / замужем                 0      F   сотрудник     0
12  гражданский брак                 1      M   пенсионер     0
13   женат / замужем                 0      F   сотрудник     0
14  гражданский брак                 1      F   компаньон     1
15   женат / замужем                 0      F   сотрудник     0
16   женат / замужем                 0      F   сотрудник     0
17  гражданский брак                 1      M   сотрудник     0
18    вдовец / вдова                 2      F   пенсионер     0
19         в разводе                 3      F   сотрудник     0

     total_income                                 purpose
0   253875.639453                           покупка жилья
1   112080.014102                 приобретение автомобиля
2   145885.952297                           покупка жилья
3   267628.550329              дополнительное образование
4   158616.077870                         сыграть свадьбу
5   255763.565419                           покупка жилья
6   240525.971920                       операции с жильем
7   135823.934197                             образование
8    95856.832424                   на проведение свадьбы
9   144425.938277                 покупка жилья для семьи
10  113943.491460                    покупка недвижимости
11   77069.234271       покупка коммерческой недвижимости
12            NaN                         сыграть свадьбу
13  130458.228857                 приобретение автомобиля
14  165127.911772              покупка жилой недвижимости
15  116820.904450  строительство собственной недвижимости
16  289202.704229                            недвижимость
17   90410.586745              строительство недвижимости
18   56823.777243      на покупку подержанного автомобиля
19  242831.107982            на покупку своего автомобиля

**Задание 3. Выведите основную информацию о датафрейме с помощью метода `info()`.**

In [4]:
# ваш код здесь
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB
None

## Предобработка данных

### Удаление пропусков

**Задание 4. Выведите количество пропущенных значений для каждого столбца. Используйте комбинацию двух методов.**

In [5]:
# ваш код здесь
print(data.isna().sum())

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

**Задание 5. В двух столбцах есть пропущенные значения. Один из них — `days_employed`. Пропуски в этом столбце вы обработаете на следующем этапе. Другой столбец с пропущенными значениями — `total_income` — хранит данные о доходах. На сумму дохода сильнее всего влияет тип занятости, поэтому заполнить пропуски в этом столбце нужно медианным значением по каждому типу из столбца `income_type`. Например, у человека с типом занятости `сотрудник` пропуск в столбце `total_income` должен быть заполнен медианным доходом среди всех записей с тем же типом.**

In [6]:
# ваш код здесь
bla = data.groupby('income_type')['total_income'].median().to_frame()
data.loc[data['total_income'].isna(), 'total_income'] =  data.loc[data['total_income'].isna(),'income_type'].apply(lambda x: bla.loc[x,'total_income'] )

### Обработка аномальных значений

**Задание 6. В данных могут встречаться артефакты (аномалии) — значения, которые не отражают действительность и появились по какой-то ошибке. Таким артефактом будет отрицательное количество дней трудового стажа в столбце `days_employed`. Для реальных данных это нормально. Обработайте значения в этом столбце: замените все отрицательные значения положительными с помощью метода `abs()`.**

In [7]:
# ваш код здесь
data['days_employed'] = data['days_employed'].abs()

**Задание 7. Для каждого типа занятости выведите медианное значение трудового стажа `days_employed` в днях.**

In [8]:
# ваш код здесь
print(data.groupby('income_type')['days_employed'].median())

income_type
безработный        366413.652744
в декрете            3296.759962
госслужащий          2689.368353
компаньон            1547.382223
пенсионер          365213.306266
предприниматель       520.848083
сотрудник            1574.202821
студент               578.751554
Name: days_employed, dtype: float64

У двух типов (безработные и пенсионеры) получатся аномально большие значения. Исправить такие значения сложно, поэтому оставьте их как есть.

**Задание 8. Выведите перечень уникальных значений столбца `children`.**

In [9]:
# ваш код здесь
print(data['children'].unique())

[ 1  0  3  2 -1  4 20  5]

**Задание 9. В столбце `children` есть два аномальных значения. Удалите строки, в которых встречаются такие аномальные значения из датафрейма `data`.**

In [10]:
# ваш код здесь
data = data[(data['children']>=0)&(data['children']<20)]

**Задание 10. Ещё раз выведите перечень уникальных значений столбца `children`, чтобы убедиться, что артефакты удалены.**

In [11]:
# ваш код здесь
print(data['children'].unique())

[1 0 3 2 4 5]

### Удаление пропусков (продолжение)

**Задание 11. Заполните пропуски в столбце `days_employed` медианными значениями по каждому типу занятости `income_type`.**

In [12]:
# ваш код здесь
bla = data.groupby('income_type')['days_employed'].median().to_frame()
data.loc[data['days_employed'].isna(), 'days_employed'] =  data.loc[data['days_employed'].isna(),'income_type'].apply(lambda x: bla.loc[x,'days_employed'] )

**Задание 12. Убедитесь, что все пропуски заполнены. Проверьте себя и ещё раз выведите количество пропущенных значений для каждого столбца с помощью двух методов.**

In [13]:
# ваш код здесь
print(data.isna().sum())

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
dtype: int64

### Изменение типов данных

**Задание 13. Замените вещественный тип данных в столбце `total_income` на целочисленный с помощью метода `astype()`.**

In [14]:
# ваш код здесь
data['total_income'] = data['total_income'].astype('int')

### Обработка дубликатов

**Задание 14. Обработайте неявные дубликаты в столбце `education`. В этом столбце есть одни и те же значения, но записанные по-разному: с использованием заглавных и строчных букв. Приведите их к нижнему регистру.**

In [15]:
# ваш код здесь
data['education'] = data['education'].str.lower()

**Задание 15. Выведите на экран количество строк-дубликатов в данных. Если такие строки присутствуют, удалите их.**

In [16]:
# посчитайте дубликаты
print(data.duplicated().sum())

71

In [17]:
# удалите дубликаты
data = data.drop_duplicates()

### Категоризация данных

**Задание 16. На основании диапазонов, указанных ниже, создайте в датафрейме `data` столбец `total_income_category` с категориями:**

- 0–30000 — `'E'`;
- 30001–50000 — `'D'`;
- 50001–200000 — `'C'`;
- 200001–1000000 — `'B'`;
- 1000001 и выше — `'A'`.


**Например, кредитополучателю с доходом 25000 нужно назначить категорию `'E'`, а клиенту, получающему 235000, — `'B'`. Используйте собственную функцию с именем `categorize_income()` и метод `apply()`.**

In [18]:
# создайте функцию categorize_income()
def categorize_income(bla):
    if bla <= 30000:
        return 'E'
    elif (bla>=30001) & (bla<=50000):
        return 'D'
    elif (bla>=50001) & (bla<= 200000):
        return 'C'
    elif(bla>=200001) & (bla<=1000000):
        return 'B'
    else:
        return 'A'

In [19]:
# примените функцию методом apply()
data['total_income_category'] = data['total_income'].apply(categorize_income)

**Задание 17. Выведите на экран перечень уникальных целей взятия кредита из столбца `purpose`.**

In [20]:
# ваш код здесь
print(data['purpose'].unique())

['покупка жилья' 'приобретение автомобиля' 'дополнительное образование'
 'сыграть свадьбу' 'операции с жильем' 'образование'
 'на проведение свадьбы' 'покупка жилья для семьи' 'покупка недвижимости'
 'покупка коммерческой недвижимости' 'покупка жилой недвижимости'
 'строительство собственной недвижимости' 'недвижимость'
 'строительство недвижимости' 'на покупку подержанного автомобиля'
 'на покупку своего автомобиля' 'операции с коммерческой недвижимостью'
 'строительство жилой недвижимости' 'жилье'
 'операции со своей недвижимостью' 'автомобили' 'заняться образованием'
 'сделка с подержанным автомобилем' 'получение образования' 'автомобиль'
 'свадьба' 'получение дополнительного образования' 'покупка своего жилья'
 'операции с недвижимостью' 'получение высшего образования'
 'свой автомобиль' 'сделка с автомобилем' 'профильное образование'
 'высшее образование' 'покупка жилья для сдачи' 'на покупку автомобиля'
 'ремонт жилью' 'заняться высшим образованием']

**Задание 18. Создайте функцию, которая на основании данных из столбца `purpose` сформирует новый столбец `purpose_category`, в который войдут следующие категории:**

- `'операции с автомобилем'`,
- `'операции с недвижимостью'`,
- `'проведение свадьбы'`,
- `'получение образования'`.

**Например, если в столбце `purpose` находится подстрока `'на покупку автомобиля'`, то в столбце `purpose_category` должна появиться строка `'операции с автомобилем'`.**

**Используйте собственную функцию с именем `categorize_purpose()` и метод `apply()`. Изучите данные в столбце `purpose` и определите, какие подстроки помогут вам правильно определить категорию.**

In [21]:
# создайте функцию categorize_purpose()
def categorize_purpose(bla):
    if bla.find('автомобил')>=0:
        return 'операции с автомобилем'
    elif (bla =='на проведение свадьбы') | (bla =='свадьба') | (bla =='сыграть свадьбу'):
        return 'проведение свадьбы'
    elif (bla.find('недвижимост')>=0) | (bla.find('жиль')>=0):
        return 'операции с недвижимостью'
    else:
        return 'получение образования'

In [22]:
# примените функцию методом apply()
data['purpose_category'] = data['purpose'].apply(categorize_purpose)

## Задание 19. Есть ли зависимость между количеством детей и возвратом кредита в срок?

In [23]:
data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,total_income_category,purpose_category
0,1,8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,B,операции с недвижимостью
1,1,4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,C,операции с автомобилем
2,0,5623.422610,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,C,операции с недвижимостью
3,3,4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,B,получение образования
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,C,проведение свадьбы

In [24]:
data_grouped = data.groupby(['debt','children'])['family_status'].count().to_frame().reset_index()

In [25]:
dc_table = data_grouped.pivot_table(index = 'children', columns = 'debt', values = 'family_status')
dc_table.columns = ['Without_debt','With_debt']

In [26]:
pd.set_option('display.float_format', '{:.2f}'.format)
dc_table['part_with_debt'] = (dc_table['With_debt']/dc_table['With_debt'].sum())*100
dc_table['part_without_debt']= (dc_table['Without_debt']/dc_table['Without_debt'].sum())*100
dc_table['different'] = ((dc_table['part_without_debt']- dc_table['part_with_debt'])/dc_table['part_without_debt'])*100
dc_table['Доля должников в категории'] = (dc_table['With_debt']/(dc_table['With_debt']+dc_table['Without_debt']))*100

In [27]:
dc_table

,Without_debt,With_debt,part_with_debt,part_without_debt,different,Доля должников в категории
children,,,,,,
0,13028.00,1063.00,61.37,66.47,7.67,7.54
1,4364.00,444.00,25.64,22.27,-15.13,9.23
2,1858.00,194.00,11.20,9.48,-18.15,9.45
3,303.00,27.00,1.56,1.55,-0.83,8.18
4,37.00,4.00,0.23,0.19,-22.33,9.76
5,9.00,NaN,NaN,0.05,NaN,NaN

1. Наличие детей и наличие задолженности явно имеют зависимость
2. Доля людей без детей, среди тех кто имел задолженность, составляет 61,37% от всех людей без задолженностей, что на 7,67% меньше, чем доля людей без детей, но с задолженностями, которые составляют 66,47% от всех людей, которые имеют задолженности

## Задание 20. Есть ли зависимость между семейным положением и возвратом кредита в срок?

In [29]:
data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,total_income_category,purpose_category
0,1,8437.67,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,B,операции с недвижимостью
1,1,4024.80,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,C,операции с автомобилем
2,0,5623.42,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,C,операции с недвижимостью
3,3,4124.75,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,B,получение образования
4,0,340266.07,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,C,проведение свадьбы

In [30]:
data_grouped = data.groupby(['family_status','debt'])['children'].count().to_frame().reset_index()
data_grouped

           family_status  debt  children
0  Не женат / не замужем     0      2523
1  Не женат / не замужем     1       273
2              в разводе     0      1105
3              в разводе     1        84
4         вдовец / вдова     0       888
5         вдовец / вдова     1        63
6       гражданский брак     0      3749
7       гражданский брак     1       385
8        женат / замужем     0     11334
9        женат / замужем     1       927

In [31]:
fd_table = data_grouped.pivot(index = 'family_status', columns = 'debt', values = 'children')
fd_table.columns = ['Without_debt','With_debt']

In [32]:
fd_table['part_with_debt'] = (fd_table['With_debt']/fd_table['With_debt'].sum())*100
fd_table['part_without_debt']=(fd_table['Without_debt']/fd_table['Without_debt'].sum())*100
fd_table['different'] = ((fd_table['part_without_debt']- fd_table['part_with_debt'])/fd_table['part_without_debt'])*100
fd_table['Доля должников в категории'] = (fd_table['With_debt']/(fd_table['With_debt']+fd_table['Without_debt']))*100

In [33]:
fd_table

,Without_debt,With_debt,part_with_debt,part_without_debt,different,Доля должников в категории
family_status,,,,,,
Не женат / не замужем,2523,273,15.76,12.87,-22.44,9.76
в разводе,1105,84,4.85,5.64,13.98,7.06
вдовец / вдова,888,63,3.64,4.53,19.72,6.62
гражданский брак,3749,385,22.23,19.13,-16.21,9.31
женат / замужем,11334,927,53.52,57.83,7.45,7.56

1. Зависимость определенно имеется
2. Так у категорий женат/замужем, вдовец/вдова/, в разводе вероятность наличия задолженности меньше на 7,45%, 19,72%, 13,98% соответственно
3. В то же время вероятность наличия задолженности растет у катерий гражданский брак и не женат/ не замужем на 16,21% и 22,44% соответственно

Если посмотреть в разрезе по категориям в целом выводы не меняются

## Задание 21. Есть ли зависимость между уровнем дохода и возвратом кредита в срок?

In [34]:
data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,total_income_category,purpose_category
0,1,8437.67,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,B,операции с недвижимостью
1,1,4024.80,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,C,операции с автомобилем
2,0,5623.42,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,C,операции с недвижимостью
3,3,4124.75,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,B,получение образования
4,0,340266.07,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,C,проведение свадьбы

In [35]:
data_grouped = data.groupby(['total_income_category','debt'])['children'].count().to_frame().reset_index()
data_grouped

  total_income_category  debt  children
0                     A     0        23
1                     A     1         2
2                     B     0      4660
3                     B     1       354
4                     C     0     14568
5                     C     1      1353
6                     D     0       328
7                     D     1        21
8                     E     0        20
9                     E     1         2

In [36]:
ticd_table = data_grouped.pivot(index = 'total_income_category', columns = 'debt', values = 'children')
ticd_table.columns = ['Without_debt','With_debt']

In [37]:
ticd_table['part_with_debt'] = ticd_table['With_debt']/ticd_table['With_debt'].sum()
ticd_table['part_without_debt']=ticd_table['Without_debt']/ticd_table['Without_debt'].sum()
ticd_table['different'] = (ticd_table['part_without_debt']- ticd_table['part_with_debt'])/ticd_table['part_without_debt']

In [38]:
ticd_table

,Without_debt,With_debt,part_with_debt,part_without_debt,different
total_income_category,,,,,
A,23,2,0.00,0.00,0.02
B,4660,354,0.20,0.24,0.14
C,14568,1353,0.78,0.74,-0.05
D,328,21,0.01,0.02,0.28
E,20,2,0.00,0.00,-0.13

По полученным данным невозможно делать какие-либо выводы, поскольку на 2 группы В и С приходятся более 95%  всей выборки. Поэтому сменим подход в определении категории уровня дохода. Возьмем распределение по процентилям:

In [39]:
data['total_income_category'] = np.where(data['total_income']<data['total_income'].quantile(0.10), 'F', \
                                        np.where(data['total_income']<data['total_income'].quantile(0.20), 'E', \
                                        np.where(data['total_income']<data['total_income'].quantile(0.40), 'D', \
                                        np.where(data['total_income']<data['total_income'].quantile(0.60), 'C', \
                                        np.where(data['total_income']<data['total_income'].quantile(0.80), 'B','A')))))

In [40]:
print(data['total_income'].quantile(0.10))
print(data['total_income'].quantile(0.20))
print(data['total_income'].quantile(0.40))
print(data['total_income'].quantile(0.60))
print(data['total_income'].quantile(0.80))

78710.0
98514.0
132113.0
161380.0
214604.0

In [41]:
data_grouped = data.groupby(['total_income_category','debt'])['children'].count().to_frame().reset_index()
data_grouped

   total_income_category  debt  children
0                      A     0      3968
1                      A     1       299
2                      B     0      3908
3                      B     1       358
4                      C     0      3892
5                      C     1       375
6                      D     0      3910
7                      D     1       356
8                      E     0      1945
9                      E     1       187
10                     F     0      1976
11                     F     1       157

In [42]:
ticd_table = data_grouped.pivot(index = 'total_income_category', columns = 'debt', values = 'children')
ticd_table.columns = ['Without_debt','With_debt']

In [43]:
ticd_table['part_with_debt'] = ticd_table['With_debt']/ticd_table['With_debt'].sum()
ticd_table['part_without_debt']=ticd_table['Without_debt']/ticd_table['Without_debt'].sum()
ticd_table['different'] = (ticd_table['part_without_debt']- ticd_table['part_with_debt'])/ticd_table['part_without_debt']

In [44]:
ticd_table

,Without_debt,With_debt,part_with_debt,part_without_debt,different
total_income_category,,,,,
A,3968,299,0.17,0.20,0.15
B,3908,358,0.21,0.20,-0.04
C,3892,375,0.22,0.20,-0.09
D,3910,356,0.21,0.20,-0.03
E,1945,187,0.11,0.10,-0.09
F,1976,157,0.09,0.10,0.10

Взаимосвязь и наличием/отсутствием задолженности нелинейная. Нельзя сказать с уверенностью что есть какая-то четкая зависимость

## Задание 22. Как разные цели кредита влияют на его возврат в срок?

In [45]:
data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,total_income_category,purpose_category
0,1,8437.67,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,A,операции с недвижимостью
1,1,4024.80,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,D,операции с автомобилем
2,0,5623.42,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,C,операции с недвижимостью
3,3,4124.75,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,A,получение образования
4,0,340266.07,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,C,проведение свадьбы

In [46]:
data_grouped = data.groupby(['purpose_category','debt'])['children'].count().to_frame().reset_index()
data_grouped

           purpose_category  debt  children
0    операции с автомобилем     0      3879
1    операции с автомобилем     1       400
2  операции с недвижимостью     0      9971
3  операции с недвижимостью     1       780
4     получение образования     0      3619
5     получение образования     1       369
6        проведение свадьбы     0      2130
7        проведение свадьбы     1       183

In [47]:
pcd_table = data_grouped.pivot(index = 'purpose_category', columns = 'debt', values = 'children')
pcd_table.columns = ['Without_debt','With_debt']

In [48]:
pcd_table['part_with_debt'] = pcd_table['With_debt']/pcd_table['With_debt'].sum()
pcd_table['part_without_debt']=pcd_table['Without_debt']/pcd_table['Without_debt'].sum()
pcd_table['different'] = (pcd_table['part_without_debt'] - pcd_table['part_with_debt'])/pcd_table['part_without_debt']
pcd_table['debt_part'] = pcd_table['With_debt']/(pcd_table['With_debt']+pcd_table['Without_debt'])

In [49]:
pcd_table

,Without_debt,With_debt,part_with_debt,part_without_debt,different,debt_part
purpose_category,,,,,,
операции с автомобилем,3879,400,0.23,0.20,-0.17,0.09
операции с недвижимостью,9971,780,0.45,0.51,0.11,0.07
получение образования,3619,369,0.21,0.18,-0.15,0.09
проведение свадьбы,2130,183,0.11,0.11,0.03,0.08

1. В некоторых категориях, а именно в операциях с автомобилями и получением образования вероятность возврата долга на 15%-16% ниже
2. В то время как в операциях с недвижимостью вероятность возврата на 11% выше

## Задание 23. Приведите возможные причины появления пропусков в исходных данных.

In [50]:
data = pd.read_csv('data.csv')

In [51]:
data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.67,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.64,покупка жилья
1,1,-4024.80,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.01,приобретение автомобиля
2,0,-5623.42,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.95,покупка жилья
3,3,-4124.75,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.55,дополнительное образование
4,0,340266.07,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.08,сыграть свадьбу

In [52]:
data.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

Причины пропусков: 
1. В случае если заемщик не работал, тогда и не получал зарплату. В связи с этим информация о стаже не записывалась, отсюда и пропуски
2. В случае если заемщик работал неофициально, в общий стаж это не было зачтено. Отсюда и пропуски в заработной плате
3. В случае если заемщик не принес документы, подтверждающие наличие стажа и заработной платы
4. В случае если сотрудник банка не внес информацию о трудовом стаже и заработной плате

## Задание 24. Объясните, почему заполнить пропуски медианным значением — лучшее решение для количественных переменных.

Поскольку медиана меньше подвержена выбросам, заполнение пропусков медианным значением усредняет выборку не сдвигая ее в сторону выборосов

## Вывод:

Исходя из полученных данных, можно сделать вывод о том что на вероятность появления задолженностей у клиента непосредственно влияют следущие категории, а именно: 
1. Число детей. Доля людей без детей, среди тех кто имел задолженность, составляет 61,37% от всех людей без задолженностей, что на 7,67% меньше, чем доля людей без детей, но с задолженностями, которые составляют 66,47% от всех людей, которые имеют задолженности
2. Семейное положение. Вероятность наличия задолженности растет у катерий гражданский брак и не женат/ не замужем на 16,21% и 22,44% соответственно
3. Цель кредита. В некоторых категориях, а именно в операциях с автомобилями и получением образования вероятность возврата долга на 15%-16% ниже